balance/src/Catalogs/СтатьиДвижения/СтатьиДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвижения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные cредства</description>
    </items>
    <items>
      <name>Прибыль</name>
      <description>Прибыль</description>
    </items>
  </predefined>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Внутренний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Внутренний</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделДДС</name>
    <type>
      <types>EnumRef.РазделыДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделОПиУДоход</name>
    <type>
      <types>CatalogRef.РазделыОПиУ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделОПиУРасход</name>
    <type>
      <types>CatalogRef.РазделыОПиУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБаланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйПуть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

balance/src/Catalogs/СтатьиДвижения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Попытка
		ВнешниеИсточникиДанных.BalanceDB.dbo_Insert_fond(ЭтотОбъект.КодБаланс,ЭтотОбъект.Родитель.Родитель.КодБаланс,ЭтотОбъект.Родитель.КодБаланс,ЭтотОбъект.Подразделение.кодБаланс,"1",ЭтотОбъект.Наименование,ЭтотОбъект.Валюта.Наименование,"","1","",0);
	Исключение
		Сообщить(ОписаниеОшибки());
		//ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации
	КонецПопытки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
